ItzCopiouz/ESP-SMS/firmware/sdkconfig.defaults
# sdkconfig.defaults - Default configuration values
# These are applied when you first run 'idf.py set-target' or 'idf.py build'
# You can override any of these later via 'idf.py menuconfig'

# Target chip
CONFIG_IDF_TARGET="esp32"

# Enable PSRAM (required for camera frame buffers)
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096

# Camera frame buffer in PSRAM 
CONFIG_CAMERA_TASK_STACK_SIZE=4096

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Partition table - use larger app partition
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Enable TLS for HTTPS
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_SSL_MAX_CONTENT_LEN=16384
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# WiFi - use static RX buffer for stability
CONFIG_ESP32_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP32_WIFI_DYNAMIC_RX_BUFFER_NUM=32

# Logging level (INFO is good for development, change to WARN for production)
CONFIG_LOG_VERSION=2



